import React from "react";

const Force = () => {
  return (
    <div className="mt-20 text-bold text-[#fff]">
      <h1 className="text-center text-3xl">
        หมวดการเรียนรู้เรื่อง แรงและกฎการเคลื่อน
      </h1>

      <div className="mt-10 bg-gray-800 p-6 rounded-lg shadow-md max-w-6xl mx-auto">
        <div className="text-xl">
          <p className="ml-3">
            ผู้เล่นรับบทเป็นนักวิทยาศาสตร์ฝึกหัดที่ได้รับมอบหมายจากหน่วยงานวิจัยลับแห่งหนึ่งเพื่อแก้ปัญหาในโลกอนาคต
          </p>
          <p>
            ซึ่งต้องใช้ความรู้ด้านฟิสิกส์
            เพื่อช่วยเหลือนักวิทยาศาสตร์หลักที่ถูกขังอยู่ในศูนย์วิจัย โดยมี 3
            ภารกิจใหญ่ที่เชื่อมโยงกัน
          </p>
          <p>1. ภารกิจการเคลื่อนที่ (หมวด 1)</p>
          <p>2. ภารกิจโพรเจกไทล์ (หมวด 2)</p>
          <p>3. ภารกิจโมเมนตัมและการชน (หมวด 3)</p>
          <p>
            นแต่ละด่าน ผู้เล่นจะค่อยๆ
            ได้รับคำใบ้เกี่ยวกับตำแหน่งของนักวิทยาศาสตร์
            และในด่านสุดท้ายของหมวดที่ 3
            ผู้เล่นจะต้องใช้ความรู้ที่สะสมมาตลอดเพื่อช่วยพวกเขาออกจากห้องทดลองที่กำลังจะระเบิด
          </p>
        </div>
      </div>
      <h1 className="text-center text-3xl mt-10">เนื้อหาการเล่น</h1>
      <div className="mt-10 bg-gray-800 p-6 rounded-lg shadow-md max-w-6xl mx-auto">
        <div className="text-xl">
          <p className="ml-3">
            ในหมวดการเรียนรู้นี้มีทั้งหมด 10 ด่าน
            โดยจะมีระบบรักษาความปลอดภัยของศูนย์วิจัยถูกปิดกั้นด้วยกลไกที่ใช้วัตถุและแรงในการทำงาน
          </p>
          <p>
            ผู้เล่นต้องใช้ความรู้กฎการเคลื่อนที่ของนิวตันในการแก้กลไกเพื่อปลดล็อกประตูแต่ละชั้น
          </p>
          <div
            style={{
              display: "grid",
              gridTemplateColumns: "1fr 1fr",
              gap: "1rem",
              marginTop: "1.5rem",
              marginBottom: "1rem"
            }}
          >
            <div className="ml-10">
              <p>ด่าน 1: ดึงลังเพื่อปลดล็อก</p>
              <p>ด่าน 2: ทางลาดเอียง</p>
              <p>ด่าน 3: ทางลาดสองชั้น</p>
              <p>ด่าน 4: แก้สมดุลลูกตุ้ม</p>
              <p>ด่าน 5: ระบบรอกพื้นฐาน</p>
            </div>
            <div>
              <p>ด่าน 6: ผลักลูกบอลผ่านกำแพง</p>
              <p>ด่าน 7: เครื่องจักรสมดุล</p>
              <p>ด่าน 8: ส่งลังผ่านลู่วิ่ง</p>
              <p>ด่าน 9: ห้องทดสองแบบหมุน</p>
              <p>ด่าน 10: ระบบสมดุลสุดท้าย</p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Force;
