"use client";
import React from "react";

const Rule = () => {
  return (
    <div className="mt-10 text-bold text-[#fff]">
      <h1 className="text-center text-3xl">กฎการเล่น และความสามารถ</h1>

      <div className="mt-10 bg-gray-800 p-6 rounded-lg shadow-md max-w-6xl mx-auto">
        <h1 className="text-2xl mb-3 text-bold">การผ่านด่าน</h1>
        <div className="text-xl">
          <p className="ml-3">
            ผู้เล่นจะต้องใช้ความรู้ทางด้านฟิสิกส์ของแต่ละหมวดหมู่แก้ปัญหาของด่านนั้น
            ๆ ในเวลาที่กำหนดในแต่ละด่าน โดยในแต่ละด่านจะมีเวลา
          </p>
          <p>
            แตกต่างกันถ้าผู้ใช้สามารถแก้ปัญหาก่อนเวลาหมดได้ก็จะผ่าน
            แต่ถ้าใช้เวลามากกว่าที่กำหนดก็จะไม่ผ่านด่าน และต้องเล่นใหม่
          </p>
        </div>
        <h1 className="text-2xl mb-3 text-bold mt-3">การให้คะแนน</h1>
        <div className="text-xl">
          <p className="ml-3">
            ในแต่ละด่านจะมีคะแนนที่กำหนดให้ผ่านไว้ และคะแนนสูงสุด อย่างเช่น
            คะแนนที่จะให้ผ่านคือ 50 คะแนน คะแนนเต็มคือ 100 คะแนน
          </p>
          <p>
            ถ้าผู้เล่นใช้เวลาครบตามที่กำหนดจะได้ 50 คะแนน
            แต่ถ้าผู้เล่นใช้เวลาน้อยกว่าเวลาที่กำหนดจะได้คะแนนเพิ่ม นาทีละ 10
            คะแนน
          </p>
        </div>
        <h1 className="text-2xl mb-3 text-bold mt-3">การเคลื่อนที่</h1>
        <div className="text-xl">
          <p className="ml-3">
            การเคลื่อนที่ภายในเกมผู้เล่นสามารถเคลื่อนที่แบบ teleport
            ไปยังพื้นที่ที่กำหนดได้ และสามารถเคลื่อนที่แบบ armswing ได้
          </p>
          <p>โดยผู้ใช้สามารถเลือกได้ว่าจะใช้วิธีเคลื่อนที่แบบไหน</p>
        </div>
        <h1 className="text-2xl mb-3 text-bold mt-3">การคำนวณ</h1>
        <div className="text-xl">
          <p className="ml-3">
            ในการแก้ปัญหาในแต่ละด่านจะต้องใช้สูตรทางฟิสิกส์ตามหมวดหมู่นั้น ๆ
            ผู้เล่นต้องแทนสูตรเพื่อคำนวณ ดังนั้นจึงต้องมีพื้นที่ให้ผู้เล่น
          </p>
          <p>
            สามารถเขียนคำนวณได้
            โดยผู้เล่นสามารถเรียกกระดานเพื่อทำการเขียนคำนวณได้ผ่านตัวควบคุม
          </p>
        </div>
      </div>
    </div>
  );
};

export default Rule;
