import React from "react";

const Momentum = () => {
  return (
    <div className="mt-20 text-bold text-[#fff]">
      <h1 className="text-center text-3xl">
        หมวดการเรียนรู้เรื่อง โมเมนตัมและการชน
      </h1>

      <div className="mt-10 bg-gray-800 p-6 rounded-lg shadow-md max-w-6xl mx-auto">
        <div className="text-xl">
          <p className="ml-3">
            ผู้เล่นรับบทเป็นนักวิทยาศาสตร์ฝึกหัดที่ได้รับมอบหมายจากหน่วยงานวิจัยลับแห่งหนึ่งเพื่อแก้ปัญหาในโลกอนาคต
          </p>
          <p>
            ซึ่งต้องใช้ความรู้ด้านฟิสิกส์
            เพื่อช่วยเหลือนักวิทยาศาสตร์หลักที่ถูกขังอยู่ในศูนย์วิจัย โดยมี 3
            ภารกิจใหญ่ที่เชื่อมโยงกัน
          </p>
          <p>1. ภารกิจการเคลื่อนที่ (หมวด 1)</p>
          <p>2. ภารกิจโพรเจกไทล์ (หมวด 2)</p>
          <p>3. ภารกิจโมเมนตัมและการชน (หมวด 3)</p>
          <p>
            นแต่ละด่าน ผู้เล่นจะค่อยๆ
            ได้รับคำใบ้เกี่ยวกับตำแหน่งของนักวิทยาศาสตร์
            และในด่านสุดท้ายของหมวดที่ 3
            ผู้เล่นจะต้องใช้ความรู้ที่สะสมมาตลอดเพื่อช่วยพวกเขาออกจากห้องทดลองที่กำลังจะระเบิด
          </p>
        </div>
      </div>
      <h1 className="text-center text-3xl mt-10">เนื้อหาการเล่น</h1>
      <div className="mt-10 bg-gray-800 p-6 rounded-lg shadow-md max-w-6xl mx-auto">
        <div className="text-xl">
          <p className="ml-3">
            ในหมวดการเรียนรู้นี้มีทั้งหมด 10 ด่าน
            โดยชั้นสุดท้ายคือระบบกลไกป้องกันที่ซับซ้อนที่สุด
            ผู้เล่นต้องใช้ความรู้โมเมนตัมและการชน
          </p>
          <p>
            ในการแก้กลไกลเพื่อปลดล็อกประตูไปห้องสุดท้ายเพื่อช่วยนักวิทยาศาสตร์ออกมาให้ได้ก่อนที่ห้องจะระเบิด
          </p>
          <div
            style={{
              display: "grid",
              gridTemplateColumns: "1fr 1fr",
              gap: "1rem",
              marginTop: "1.5rem",
              marginBottom: "1rem"
            }}
          >
            <div className="ml-10">
              <p>ด่าน 1: การชนแบบตรง</p>
              <p>ด่าน 2: ระบบการชนต่อเนื่อง</p>
              <p>ด่าน 3: การชนแบบเฉียง</p>
              <p>ด่าน 4: การชนแบบไม่ยืดหยุ่น</p>
              <p>ด่าน 5: ส่งแรงผลักต่อเนื่อง</p>
            </div>
            <div>
              <p>ด่าน 6: ห้องชนแบบผสม</p>
              <p>ด่าน 7: ระบบชนแบบวงกลม</p>
              <p>ด่าน 8: การชนสามมิติ</p>
              <p>ด่าน 9: วงจรการชนต่อเนื่อง</p>
              <p>ด่าน 10: ระบบชนและเป้าหมายเคลื่อนที่</p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Momentum;
